# PartMakerSplitterProfileEdgeMatch Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..PartMakerSplitterProfileEdgeMatch Property
ParameterTypeId Class See Also
---
"Edge Match"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId PartMakerSplitterProfileEdgeMatch { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property PartMakerSplitterProfileEdgeMatch As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ PartMakerSplitterProfileEdgeMatch {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace